cask_args appdir: "/Applications"

# formulae
tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"

# Web Browsers
cask "google-chrome"

# Development
brew "python"
brew "git"
brew "tmux"
brew "npm"
brew "mas"
brew "tor"
brew "wget"
brew "pass"
brew "gnupg"
brew "pinentry-mac"
brew "exa"
brew "node"
brew "selecta"
brew "htop"

cask "visual-studio-code"
cask "iterm2"
cask "etcher"

# Utilities
cask "flux"
cask "google-backup-and-sync"
cask "the-unarchiver"
cask "alfred"
cask "bettertouchtool"
cask "bartender"
cask "karabiner-elements"

# Media/messaging/entertainment
cask "slack"
cask "spotify"
cask "imageoptim"
cask "transmission"
cask "vlc"
